/* No comment provided by engineer. */
"aboutPanel.version" = "版本 %@";

/* No comment provided by engineer. */
"canvas.contextMenu.addNewElement" = "添加新元素…";

/* No comment provided by engineer. */
"canvas.contextMenu.delete" = "删除";

/* No comment provided by engineer. */
"canvas.contextMenu.deleteLabel" = "删除标签";

/* No comment provided by engineer. */
"canvas.contextMenu.deleteRelationship" = "取消关联";

/* No comment provided by engineer. */
"canvas.contextMenu.duplicate" = "创建副本";

/* No comment provided by engineer. */
"canvas.contextMenu.editCaption" = "编辑标题";

/* No comment provided by engineer. */
"canvas.contextMenu.editLabel" = "编辑标签";

/* No comment provided by engineer. */
"canvas.contextMenu.editTypeInPalette" = "在调色盘修改类型…";

/* No comment provided by engineer. */
"canvas.contextMenu.lockBothEnds" = "锁定全部末端";

/* No comment provided by engineer. */
"canvas.contextMenu.lockEnds" = "锁定末端";

/* No comment provided by engineer. */
"canvas.contextMenu.lockRelationshipEnds" = "锁定连接末端";

/* No comment provided by engineer. */
"canvas.contextMenu.pasteHere" = "粘贴在这里";

/* No comment provided by engineer. */
"canvas.contextMenu.resetLabelPosition" = "重置标签位置";

/* No comment provided by engineer. */
"canvas.contextMenu.resetRoute" = "重置路径";

/* No comment provided by engineer. */
"canvas.contextMenu.resetRoute.plural" = "重置所有路径";

/* No comment provided by engineer. */
"canvas.contextMenu.reverseDirection" = "反向";

/* No comment provided by engineer. */
"canvas.contextMenu.reverseDirection.plural" = "反向";

/* No comment provided by engineer. */
"canvas.contextMenu.selectAll" = "全选";

/* No comment provided by engineer. */
"canvas.contextMenu.selectConnectObjects" = "选择已连接对象";

/* No comment provided by engineer. */
"canvas.contextMenu.selectElementsOfSameType" = "选择相同类型的元素";

/* No comment provided by engineer. */
"canvas.contextMenu.selectRelationshipsOfSameType" = "选择相同类型的连接";

/* No comment provided by engineer. */
"canvas.contextMenu.setElementType" = "设置元素属性…";

/* No comment provided by engineer. */
"canvas.contextMenu.setRelationshipType" = "设置连接属性…";

/* No comment provided by engineer. */
"canvas.contextMenu.setType" = "设定类型…";

/* No comment provided by engineer. */
"canvas.contextMenu.unlockBothEnds" = "解锁全部末端";

/* No comment provided by engineer. */
"canvas.contextMenu.unlockEnds" = "解锁末端";

/* No comment provided by engineer. */
"canvas.contextMenu.unlockRelationshipEnds" = "解锁全部末端连接";

/* No comment provided by engineer. */
"canvas.contextMenu.zoomIn" = "放大";

/* No comment provided by engineer. */
"canvas.contextMenu.zoomOut" = "缩小";

/* No comment provided by engineer. */
"canvas.contextMenu.zoomToBase" = "放大 100%";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.delete" = "删除";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.deleteElement" = "删除元素";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.deleteElement.plural" = "删除所有元素";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.deleteObjects" = "删除对象";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.deleteRelationship" = "删除关联";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.deleteRelationship.plural" = "删除所有关联";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.deleteRelationshipLabel" = "删除连接标签";

/* Shown in the Edit menu for the current canvas selection. */
"commandTitle.document.deleteRelationshipLabel.plural" = "删除所有连接标签";

/* Shown in the Objects menu for the current canvas selection. */
"commandTitle.document.editElementCaption" = "修改元素标题";

/* Shown in the Objects menu for the current canvas selection. */
"commandTitle.document.editRelationshipLabel" = "修改连接标签";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. */
"commandTitle.document.relationshipEndLock.lockSource" = "锁定来源末端";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. Additionally includes a preview of the attached element's caption. */
"commandTitle.document.relationshipEndLock.lockSource.elementCaptionPreview" = "锁定来源末端（%@）";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. */
"commandTitle.document.relationshipEndLock.lockTarget" = "锁定目标末端";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. Additionally includes a preview of the attached element's caption. */
"commandTitle.document.relationshipEndLock.lockTarget.elementCaptionPreview" = "锁定目标末端（%@）";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. */
"commandTitle.document.relationshipEndLock.unlockSource" = "解锁来源末端";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. Additionally includes a preview of the attached element's caption. */
"commandTitle.document.relationshipEndLock.unlockSource.elementCaptionPreview" = "解锁来源末端（%@）";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. */
"commandTitle.document.relationshipEndLock.unlockTarget" = "解锁目标末端";

/* Shown in the 'Lock Ends' submenu located in the context menu and in the Objects menu. Additionally includes a preview of the attached element's caption. */
"commandTitle.document.relationshipEndLock.unlockTarget.elementCaptionPreview" = "解锁目标末端（%@）";

/* Shown in the Objects menu for the current canvas selection. */
"commandTitle.document.resetRelationshipRoute" = "重置连接路径";

/* Shown in the Objects menu for the current canvas selection. */
"commandTitle.document.resetRelationshipRoute.plural" = "重置所有连接路径";

/* Shown in the Objects menu for the current canvas selection. */
"commandTitle.document.reverseRelationship" = "重置连接";

/* Shown in the Objects menu for the current canvas selection. */
"commandTitle.document.reverseRelationship.plural" = "重置所有连接";

/* Shown in the context menu on an item and the Edit menu. */
"commandTitle.paletteEditor.delete" = "删除";

/* Shown in the context menu on an item and the Edit menu. */
"commandTitle.paletteEditor.delete.typeInUse" = "删除（正在使用的类型）";

/* Shown in the context menu on an item and the Edit menu. */
"commandTitle.paletteEditor.delete.typeInUse.plural" = "删除（所有正在使用的类型）";

/* No comment provided by engineer. */
"dockMenu.newDocument" = "新文档";

/* No comment provided by engineer. */
"document.draftName" = "未命名图表";

/* No comment provided by engineer. */
"document.loadError.corruptedData.informativeText" = "文档可能已损坏、故障或格式不正确。";

/* Shown in an alert when attempting to load a document in an incorrect format. The placeholder is populated with the file name of the document. */
"document.loadError.corruptedData.message" = "“%@“ 无法打开，因为它的格式不正确。";

/* No comment provided by engineer. */
"document.loadError.createdWithNewerAppVersion.informativeText" = "请升级到最新版本并重试。";

/* Shown in an alert when attempting to load a document that was created with a newer version of the application. The placeholder is populated with the file name of the document. */
"document.loadError.createdWithNewerAppVersion.message" = "“%@“无法打开，因为它是用较新版本的 Diagrams 保存的。";

/* No comment provided by engineer. */
"document.loadError.upgradeFailed.buttons.closeDocument" = "关闭文档";

/* No comment provided by engineer. */
"document.loadError.upgradeFailed.buttons.contactSupport" = "联系客服";

/* No comment provided by engineer. */
"document.loadError.upgradeFailed.informativeText" = "无法升级文档，请联系客服寻求帮助。";

/* Shown in an alert when attempting to load a document which needs an upgrade that ultimately fails. */
"document.loadError.upgradeFailed.message" = "在升级文件时发生了一个意外的错误。";

/* No comment provided by engineer. */
"document.loadError.upgradeNotPossible.informativeText" = "该文档是用较旧 Diagrams 版本保存的，无法用此版本打开它。";

/* Shown in an alert when attempting to load a document whose format is outdated. The placeholder is populated with the file name of the document. */
"document.loadError.upgradeNotPossible.message" = "“%@“ 无法打开，因为它的格式已经过时。";

/* No comment provided by engineer. */
"document.upgradeConfirmation.buttons.cancel" = "取消";

/* No comment provided by engineer. */
"document.upgradeConfirmation.buttons.upgrade" = "升级";

/* No comment provided by engineer. */
"document.upgradeConfirmation.informativeText" = "该文件是用较旧的 Diagrams 版本保存的，必须升级到新的文件格式。执行升级后，该文件将无法在旧版本的 Diagrams 中读取。";

/* No comment provided by engineer. */
"document.upgradeConfirmation.message" = "是否升级该文档？";

/* No comment provided by engineer. */
"exportPanel.buttons.cancel" = "取消";

/* No comment provided by engineer. */
"exportPanel.buttons.export" = "导出";

/* No comment provided by engineer. */
"exportPanel.error.buttons.cancel" = "取消";

/* No comment provided by engineer. */
"exportPanel.error.buttons.contactSupport" = "联系客服";

/* No comment provided by engineer. */
"exportPanel.error.informativeText" = "该文档无法导出。请联系客服寻求帮助。";

/* No comment provided by engineer. */
"exportPanel.error.message" = "在准备导出数据时发生了一个意外的错误。";

/* No comment provided by engineer. */
"exportPanel.pane.image.message" = "创建一个图像文件，可以用支持 PNG 格式的图像编辑应用程序查看和编辑。";

/* No comment provided by engineer. */
"exportPanel.pane.image.options.showGrid" = "显示网格";

/* No comment provided by engineer. */
"exportPanel.pane.image.options.transparentBackground" = "透明背景";

/* No comment provided by engineer. */
"exportPanel.pane.image.title" = "图片";

/* No comment provided by engineer. */
"exportPanel.pane.pdf.message" = "创建一个矢量 PDF 文件，可以用 PDF 应用程序或 Web 浏览器查看或打印。";

/* No comment provided by engineer. */
"exportPanel.pane.pdf.options.showGrid" = "显示网格";

/* No comment provided by engineer. */
"exportPanel.pane.pdf.title" = "PDF";

/* The window title is not directly visible to the user. */
"exportPanel.windowTitle" = "导出";

/* No comment provided by engineer. */
"launchChecks.readOnlyVolume.alert.buttons.quit" = "退出";

/* No comment provided by engineer. */
"launchChecks.readOnlyVolume.alert.informativeText" = "请先将 Diagrams 拖到你的应用程序文件夹中安装。";

/* This alert is shown when attempting to launch the app from a DMG volume. */
"launchChecks.readOnlyVolume.alert.message" = "无法从磁盘映像中启动 Diagrams";

/* No comment provided by engineer. */
"launchChecks.translocation.alert.buttons.quit" = "退出";

/* No comment provided by engineer. */
"launchChecks.translocation.alert.informativeText" = "请将 Diagrams 移到应用程序文件夹，然后重新启动。";

/* This alert is shown when launching the app from the Downloads folder. */
"launchChecks.translocation.alert.message" = "Diagrams 无法从它被下载到的位置启动。";

/* No comment provided by engineer. */
"launchChecks.trialDetection.alert.buttons.ignore" = "忽略";

/* No comment provided by engineer. */
"launchChecks.trialDetection.alert.buttons.showInFinder" = "在访达中显示";

/* No comment provided by engineer. */
"launchChecks.trialDetection.alert.informativeText" = "你仍然安装了 Diagrams 的试用版。\n为了防止干扰完整版，我们建议先删除试用版，把它移到废纸篓。";

/* This alert is shown when launching the Mac App Store version of the app while having the trial version still installed. */
"launchChecks.trialDetection.alert.message" = "检测到试用版。";

/* No comment provided by engineer. */
"mainMenu.diagrams.about" = "关于 Diagrams";

/* No comment provided by engineer. */
"mainMenu.diagrams.acknowledgements" = "致谢";

/* No comment provided by engineer. */
"mainMenu.diagrams.hide" = "隐藏 Diagrams";

/* No comment provided by engineer. */
"mainMenu.diagrams.hideOthers" = "隐藏其它";

/* Only visible in the trial and beta targets. */
"mainMenu.diagrams.licenseAgreement" = "许可协议";

/* No comment provided by engineer. */
"mainMenu.diagrams.privacyPolicy" = "隐私政策";

/* No comment provided by engineer. */
"mainMenu.diagrams.quit" = "退出 Diagrams";

/* No comment provided by engineer. */
"mainMenu.diagrams.services" = "所有服务";

/* No comment provided by engineer. */
"mainMenu.diagrams.showAll" = "显示全部";

/* No comment provided by engineer. */
"mainMenu.edit" = "编辑";

/* No comment provided by engineer. */
"mainMenu.edit.copy" = "复制";

/* No comment provided by engineer. */
"mainMenu.edit.cut" = "剪贴";

/* No comment provided by engineer. */
"mainMenu.edit.deleteRelationshipLabel" = "刪除连接标签";

/* No comment provided by engineer. */
"mainMenu.edit.duplicate" = "创建副本";

/* No comment provided by engineer. */
"mainMenu.edit.paste" = "粘贴";

/* No comment provided by engineer. */
"mainMenu.edit.redo" = "重做";

/* The menu item for redoing a specific action. */
"mainMenu.edit.redo.action" = "重做 %@";

/* No comment provided by engineer. */
"mainMenu.edit.selectAll" = "全选";

/* No comment provided by engineer. */
"mainMenu.edit.selectConnectedObjects" = "选择连接的对象";

/* No comment provided by engineer. */
"mainMenu.edit.selectObjectsOfSameType" = "选择相同类型的对象";

/* No comment provided by engineer. */
"mainMenu.edit.undo" = "恢复";

/* The menu item for undoing a specific action. */
"mainMenu.edit.undo.action" = "恢复 %@";

/* No comment provided by engineer. */
"mainMenu.file.closeAll" = "关闭全部";

/* No comment provided by engineer. */
"mainMenu.file.closeWindow" = "关闭窗口";

/* No comment provided by engineer. */
"mainMenu.file.export" = "导出至…";

/* No comment provided by engineer. */
"mainMenu.file.move" = "移动至…";

/* No comment provided by engineer. */
"mainMenu.file.new" = "新建…";

/* No comment provided by engineer. */
"mainMenu.file.newWithEmptyPalette" = "创建空白调色板";

/* No comment provided by engineer. */
"mainMenu.file.open" = "打开…";

/* No comment provided by engineer. */
"mainMenu.file.rename" = "重命名…";

/* No comment provided by engineer. */
"mainMenu.file.saveAs" = "另存为…";

/* No comment provided by engineer. */
"mainMenu.help" = "帮助";

/* Only visible in the beta target. */
"mainMenu.help.betaProgram" = "测试版软件";

/* Only visible in the trial target. */
"mainMenu.help.buy" = "购买 Diagrams";

/* No comment provided by engineer. */
"mainMenu.help.faq" = "常见问题";

/* No comment provided by engineer. */
"mainMenu.help.followUsOnTwitter" = "关注我们的推特";

/* No comment provided by engineer. */
"mainMenu.help.leaveReview" = "在 Mac App Store 发表评论";

/* No comment provided by engineer. */
"mainMenu.help.openExamplesLibrary" = "打开示例库";

/* No comment provided by engineer. */
"mainMenu.help.sendUsFeedback" = "发送反馈";

/* No comment provided by engineer. */
"mainMenu.help.support" = "获取支援";

/* No comment provided by engineer. */
"mainMenu.help.visitWebsite" = "访问官网";

/* No comment provided by engineer. */
"mainMenu.help.whatIsNew" = "Diagrams 的新功能";

/* No comment provided by engineer. */
"mainMenu.objects" = "对象";

/* No comment provided by engineer. */
"mainMenu.objects.addElement" = "添加新元素…";

/* No comment provided by engineer. */
"mainMenu.objects.lockAllEnds" = "锁定全部末端";

/* No comment provided by engineer. */
"mainMenu.objects.lockRelationshipEnds" = "锁定连接末端";

/* No comment provided by engineer. */
"mainMenu.objects.resetRelationshipLabelPositions" = "重置连接标签位置";

/* No comment provided by engineer. */
"mainMenu.objects.resetRelationshipRoute" = "重置连接路由";

/* No comment provided by engineer. */
"mainMenu.objects.setElementType" = "设置元素类型…";

/* No comment provided by engineer. */
"mainMenu.objects.setRelationshipType" = "设置连接类型…";

/* No comment provided by engineer. */
"mainMenu.objects.unlockAllEnds" = "解锁全部末端";

/* No comment provided by engineer. */
"mainMenu.palette" = "调色板";

/* No comment provided by engineer. */
"mainMenu.palette.customizePalette" = "自定义调色板…";

/* No comment provided by engineer. */
"mainMenu.palette.editType" = "编辑类型…";

/* No comment provided by engineer. */
"mainMenu.palette.newType" = "新增类型…";

/* No comment provided by engineer. */
"mainMenu.palette.revertSelectedChanges" = "还原所选更改";

/* No comment provided by engineer. */
"mainMenu.view.customizeToolbar" = "自定义工具栏…";

/* No comment provided by engineer. */
"mainMenu.view.documentPalette" = "文档调色板";

/* No comment provided by engineer. */
"mainMenu.view.documentPalette.showElementTypes" = "元素类型";

/* No comment provided by engineer. */
"mainMenu.view.documentPalette.showRelationshipTypes" = "连接类型";

/* No comment provided by engineer. */
"mainMenu.view.hideToolbar" = "隐藏工具栏";

/* No comment provided by engineer. */
"mainMenu.view.zoomCanvas" = "缩放画布";

/* No comment provided by engineer. */
"mainMenu.view.zoomCanvas.zoomIn" = "放大";

/* No comment provided by engineer. */
"mainMenu.view.zoomCanvas.zoomOut" = "缩小";

/* No comment provided by engineer. */
"mainMenu.view.zoomCanvas.zoomToBase" = "缩放到100%";

/* No comment provided by engineer. */
"mainMenu.window" = "窗口";

/* No comment provided by engineer. */
"mainMenu.window.minimize" = "窗口最小化";

/* No comment provided by engineer. */
"mainMenu.window.zoom" = "窗口缩放";

/* No comment provided by engineer. */
"palette.buttons.customize" = "自定义";

/* No comment provided by engineer. */
"palette.buttons.new" = "新增";

/* The empty state is shown when there are no types in the palette. */
"palette.emptyState.button" = "新增类型";

/* The empty state is shown when there are no types in the palette. */
"palette.emptyState.label.elementType" = "创建要与新元素一起使用的第一个元素类型";

/* The empty state is shown when there are no types in the palette. */
"palette.emptyState.label.relationshipType" = "创建用于新连接的第一个连接类型";

/* No comment provided by engineer. */
"palette.headerTitle.addNewElement" = "添加新元素";

/* No comment provided by engineer. */
"palette.headerTitle.addNewRelationship" = "添加新连接";

/* No comment provided by engineer. */
"palette.headerTitle.setElementType" = "设置元素类型";

/* No comment provided by engineer. */
"palette.headerTitle.setRelationshipType" = "设置连接类型";

/* The preview text used in palette item cards for *code* font, applied to both element captions and relationship labels. */
"palette.item.cardPreview.code" = "<Aa>";

/* The preview text used in palette item cards for *regular* font, applied to both element captions and relationship labels. */
"palette.item.cardPreview.regular" = "Aa";

/* No comment provided by engineer. */
"palette.item.contextMenu.duplicate" = "创建副本…";

/* No comment provided by engineer. */
"palette.item.contextMenu.editType" = "编辑类型…";

/* No comment provided by engineer. */
"palette.item.contextMenu.showInPaletteEditor" = "在文档调色板中显示…";

/* No comment provided by engineer. */
"palette.item.placeholder" = "无标题";

/* The 'Set' variant of the confirm button is used when setting type. */
"palette.typeEditor.buttons.confirm.set" = "设定";

/* The 'Use' variant of the confirm button is used for diagram object creation. */
"palette.typeEditor.buttons.confirm.use" = "使用";

/* No comment provided by engineer. */
"palette.typeEditor.buttons.discard" = "放弃";

/* No comment provided by engineer. */
"palette.typeEditor.headerTitle.editElementType" = "编辑元素类型";

/* No comment provided by engineer. */
"palette.typeEditor.headerTitle.editRelationshipType" = "编辑连接类型";

/* No comment provided by engineer. */
"palette.typeEditor.headerTitle.newElementType" = "新元素类型";

/* No comment provided by engineer. */
"palette.typeEditor.headerTitle.newRelationshipType" = "新建连接类型";

/* No comment provided by engineer. */
"paletteChooser.buttons.cancel" = "取消";

/* No comment provided by engineer. */
"paletteChooser.buttons.create" = "创建";

/* No comment provided by engineer. */
"paletteChooser.error.corruptedData.informativeText" = "文档可能已损坏、故障或格式不正确。";

/* Shown in an alert when attempting to load a palette from a document in an incorrect format. */
"paletteChooser.error.corruptedData.message" = "无法从所选文件加载调色板，因为它的格式不正确。";

/* No comment provided by engineer. */
"paletteChooser.error.migrationFailure.buttons.cancel" = "取消";

/* No comment provided by engineer. */
"paletteChooser.error.migrationFailure.buttons.contactSupport" = "联系客服";

/* No comment provided by engineer. */
"paletteChooser.error.migrationFailure.informativeText" = "与客服取得帮助";

/* Shown in an alert when attempting to load a palette from a document which requires a migration that fails. */
"paletteChooser.error.migrationFailure.message" = "在加载调色板时发生了一个意外的错误。";

/* No comment provided by engineer. */
"paletteChooser.error.mismatchedFormat.advancedFormat.informativeText" = "该文档使用较新版的 Diagrams 创建，请升级到最新版本，再重试";

/* Shown in an alert when attempting to load a palette from a document that was created with either a newer or an older version of Diagrams. */
"paletteChooser.error.mismatchedFormat.message" = "无法从“%@”加载调色板，因为它的格式不兼容。";

/* No comment provided by engineer. */
"paletteChooser.error.mismatchedFormat.unsupportedFormat.informativeText" = "该文件是用旧版本的 Diagrams 保存的，不能在这个版本中使用它。";

/* The palette chooser item for creating a new document with an empty palette. */
"paletteChooser.item.emptyPalette" = "空白调色板";

/* The palette chooser item for creating a new document with a palette from another document. */
"paletteChooser.item.loadFromDocument" = "从现有文档加载调色板";

/* The palette chooser item for the Flowchart preset. */
"paletteChooser.item.preset.flowchart" = "流程图";

/* The palette chooser item for the Grayscale preset. */
"paletteChooser.item.preset.grayscale" = "灰阶";

/* The palette chooser item for the Universal preset. */
"paletteChooser.item.preset.universal" = "通用";

/* The prompt button in the open panel when loading a palette from an existing document. */
"paletteChooser.loadPalettePrompt" = "加载调色板";

/* No comment provided by engineer. */
"paletteChooser.section.newDocument" = "新建文档";

/* No comment provided by engineer. */
"paletteChooser.section.presets" = "从预设的调色板开始";

/* No comment provided by engineer. */
"paletteChooser.windowTitle" = "选择调色板";

/* The button that applies changes from the palette customization session. */
"paletteEditor.buttons.apply" = "应用";

/* The button that cancels the palette customization session. */
"paletteEditor.buttons.cancel" = "取消";

/* The button that discards the palette customization session. */
"paletteEditor.buttons.discard" = "还原";

/* No comment provided by engineer. */
"paletteEditor.changeCountDetails.changed" = "已更改";

/* No comment provided by engineer. */
"paletteEditor.changeCountDetails.deleted" = "已删除";

/* No comment provided by engineer. */
"paletteEditor.changeCountDetails.elementTypes" = "元素类型";

/* No comment provided by engineer. */
"paletteEditor.changeCountDetails.new" = "新建";

/* No comment provided by engineer. */
"paletteEditor.changeCountDetails.relationshipTypes" = "连接类型";

/* No comment provided by engineer. */
"paletteEditor.discardAlert.buttons.cancel" = "取消";

/* No comment provided by engineer. */
"paletteEditor.discardAlert.buttons.discard" = "放弃所有更改";

/* No comment provided by engineer. */
"paletteEditor.discardAlert.informativeText" = "无法撤消此操作";

/* No comment provided by engineer. */
"paletteEditor.discardAlert.message" = "是否放弃对文档调色板所做的所有更改？";

/* No comment provided by engineer. */
"paletteEditor.headerTitle" = "文档调色板";

/* No comment provided by engineer. */
"paletteEditor.typeEditorPane.emptySelection.label" = "选择要编辑其属性的类型";

/* No comment provided by engineer. */
"paletteEditor.typeEditorPane.multipleSelection.previewText" = "选择了多种类型";

/* The tooltip on the '+' button. */
"paletteEditor.typesPane.bottomBar.buttons.createNew.tooltip" = "创建新类型";

/* The tooltip on the '-' button when some of the selected types are in use. */
"paletteEditor.typesPane.bottomBar.buttons.delete.someInUse.tooltip" = "删除所选类型（%d个正在使用）";

/* The tooltip on the '-' button. */
"paletteEditor.typesPane.bottomBar.buttons.delete.tooltip" = "删除所选类型";

/* The count on element types tab with empty selection. */
"paletteEditor.typesPane.bottomBar.countLabel.emptySelection.elementTypes.multiple" = "%d 元素类型";

/* The count on element types tab with empty selection. */
"paletteEditor.typesPane.bottomBar.countLabel.emptySelection.elementTypes.single" = "1个元素类型";

/* The count on relationship types tab with empty selection. */
"paletteEditor.typesPane.bottomBar.countLabel.emptySelection.relationshipTypes.multiple" = "%d 连接类型";

/* The count on relationship types tab with empty selection. */
"paletteEditor.typesPane.bottomBar.countLabel.emptySelection.relationshipTypes.single" = "1个连接类型";

/* The count reflecting the current selection. */
"paletteEditor.typesPane.bottomBar.countLabel.selection" = "已选择%2$d中的%1$d";

/* The count reflecting the current selection. */
"paletteEditor.typesPane.bottomBar.countLabel.selection.someInUse" = "已选择%2$d中的%1$d（使用中的%3$d）";

/* The deletion confirmation is shown when deleting a mix of used and unused types. */
"paletteEditor.typesPane.deleteConfirmation.button" = "删除未使用的";

/* The deletion confirmation is shown when deleting a mix of used and unused types. */
"paletteEditor.typesPane.deleteConfirmation.message" = "只有图表中未使用的类型才能从调色板中删除";

/* The deletion confirmation is shown when deleting a mix of used and unused types. */
"paletteEditor.typesPane.deleteConfirmation.title" = "无法删除所有选定的类型";

/* No comment provided by engineer. */
"paletteEditor.typesPane.emptyArea.contextMenu.newType" = "新增类型";

/* No comment provided by engineer. */
"paletteEditor.typesPane.emptyArea.contextMenu.selectAll" = "选择全部";

/* The empty state is shown when there are no types in the open tab of the palette. */
"paletteEditor.typesPane.emptyState.button" = "新增类型";

/* The empty state is shown when there are no types in the open tab of the palette. */
"paletteEditor.typesPane.emptyState.label" = "创建一个新的类型，开始定制化。";

/* No comment provided by engineer. */
"paletteEditor.typesPane.item.contextMenu.delete" = "删除";

/* No comment provided by engineer. */
"paletteEditor.typesPane.item.contextMenu.duplicate" = "创建副本";

/* No comment provided by engineer. */
"paletteEditor.typesPane.item.contextMenu.revertChanges" = "还原更改";

/* The placeholder for untitled types. */
"paletteEditor.typesPane.item.placeholder" = "无标题";

/* No comment provided by engineer. */
"paletteEditor.typesPane.topBar.tabs.elementTypes" = "元素";

/* No comment provided by engineer. */
"paletteEditor.typesPane.topBar.tabs.relationshipTypes" = "连接";

/* The window title is not directly visible to the user and its value should equal to the header title. */
"paletteEditor.windowTitle" = "文档调色板";

/* No comment provided by engineer. */
"palettePreset.flowchart.elementType.decision" = "决策";

/* No comment provided by engineer. */
"palettePreset.flowchart.elementType.end" = "终止";

/* No comment provided by engineer. */
"palettePreset.flowchart.elementType.note" = "注释";

/* No comment provided by engineer. */
"palettePreset.flowchart.elementType.process" = "过程";

/* No comment provided by engineer. */
"palettePreset.flowchart.elementType.start" = "起点";

/* No comment provided by engineer. */
"palettePreset.flowchart.relationshipType.flow" = "流动";

/* No comment provided by engineer. */
"palettePreset.flowchart.relationshipType.noteLink" = "注释链接";

/* No comment provided by engineer. */
"productNews.buttons.continue" = "继续";

/* No comment provided by engineer. */
"productNews.buttons.details" = "完整的改进列表";

/* No comment provided by engineer. */
"productNews.buttons.openExamplesLibrary" = "打开示例库";

/* No comment provided by engineer. */
"productNews.header.title" = "最新消息";

/* The title of the What's New window accessible via Help > What's New in Diagrams. */
"productNews.windowTitle" = "最新消息";

/* No comment provided by engineer. */
"toolbar.addElement" = "添加元素";

/* No comment provided by engineer. */
"toolbar.addElement.overflowMenu" = "添加元素";

/* No comment provided by engineer. */
"toolbar.addElement.tooltip" = "在画布上添加一个新元素。";

/* No comment provided by engineer. */
"toolbar.export" = "导出";

/* No comment provided by engineer. */
"toolbar.export.overflowMenu" = "导出";

/* No comment provided by engineer. */
"toolbar.export.tooltip" = "导出至其它格式";

/* No comment provided by engineer. */
"toolbar.palette" = "调色版";

/* No comment provided by engineer. */
"toolbar.palette.overflowMenu" = "调色板";

/* No comment provided by engineer. */
"toolbar.palette.tooltip" = "在调色板中自定义你的文档元素和连接类型。";

/* No comment provided by engineer. */
"toolbar.rename" = "重命名";

/* No comment provided by engineer. */
"toolbar.rename.overflowMenu" = "重命名";

/* No comment provided by engineer. */
"toolbar.rename.tooltip" = "编辑所选元素标题或所选连接标签。";

/* No comment provided by engineer. */
"toolbar.setType" = "设置类型";

/* No comment provided by engineer. */
"toolbar.setType.elementType.tooltip" = "更改所选元素的类型。";

/* No comment provided by engineer. */
"toolbar.setType.overflowMenu" = "设置类型";

/* No comment provided by engineer. */
"toolbar.setType.overflowMenu.setElementType" = "设置元素类型…";

/* No comment provided by engineer. */
"toolbar.setType.overflowMenu.setRelationshipType" = "设置连接类型…";

/* No comment provided by engineer. */
"toolbar.setType.relationshipType.tooltip" = "更改所选连接的类型。";

/* No comment provided by engineer. */
"toolbar.zoom" = "缩放";

/* No comment provided by engineer. */
"toolbar.zoom.overflowMenu" = "缩放";

/* No comment provided by engineer. */
"toolbar.zoom.overflowMenu.zoomIn" = "放大";

/* No comment provided by engineer. */
"toolbar.zoom.overflowMenu.zoomOut" = "缩小";

/* No comment provided by engineer. */
"toolbar.zoom.overflowMenu.zoomToBase" = "缩放到 100%";

/* No comment provided by engineer. */
"toolbar.zoom.tooltip" = "放大或缩小图表的视图。";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.alignment.center.tooltip" = "居中对齐";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.alignment.fieldLabel" = "对齐方式：";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.alignment.left.tooltip" = "左对齐";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.alignment.right.tooltip" = "右对齐";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.format.bold.tooltip" = "粗体";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.format.code.tooltip" = "等宽";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.format.fieldLabel" = "格式：";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.format.italic.tooltip" = "斜体";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.format.underline.tooltip" = "下划线";

/* No comment provided by engineer. */
"typeEditor.elementType.caption.sectionTitle" = "标题";

/* No comment provided by engineer. */
"typeEditor.elementType.color.fieldLabel" = "颜色：";

/* No comment provided by engineer. */
"typeEditor.elementType.color.tooltip" = "预设颜色选择";

/* No comment provided by engineer. */
"typeEditor.elementType.shape.fieldLabel" = "形状：";

/* No comment provided by engineer. */
"typeEditor.elementType.shape.item.diamond" = "钻石";

/* No comment provided by engineer. */
"typeEditor.elementType.shape.item.ellipse" = "椭圆";

/* No comment provided by engineer. */
"typeEditor.elementType.shape.item.rectangle" = "矩形";

/* No comment provided by engineer. */
"typeEditor.elementType.shape.item.rounded" = "圆形";

/* No comment provided by engineer. */
"typeEditor.elementType.shape.tooltip" = "形状选择";

/* No comment provided by engineer. */
"typeEditor.elementType.title.fieldLabel" = "名称：";

/* No comment provided by engineer. */
"typeEditor.elementType.title.tooltip" = "调色板中显示的元素类型的可选标题";

/* No comment provided by engineer. */
"typeEditor.relationshipType.label.format.bold.tooltip" = "粗体";

/* No comment provided by engineer. */
"typeEditor.relationshipType.label.format.code.tooltip" = "等宽";

/* No comment provided by engineer. */
"typeEditor.relationshipType.label.format.fieldLabel" = "格式：";

/* No comment provided by engineer. */
"typeEditor.relationshipType.label.format.italic.tooltip" = "斜体";

/* No comment provided by engineer. */
"typeEditor.relationshipType.label.sectionTitle" = "标签";

/* No comment provided by engineer. */
"typeEditor.relationshipType.line.fieldLabel" = "线条：";

/* No comment provided by engineer. */
"typeEditor.relationshipType.lineHead.source.tooltip" = "源线头选择";

/* No comment provided by engineer. */
"typeEditor.relationshipType.lineHead.target.tooltip" = "目标线头选择";

/* No comment provided by engineer. */
"typeEditor.relationshipType.lineStyle.tooltip" = "线条样式选择";

/* No comment provided by engineer. */
"typeEditor.relationshipType.title.fieldLabel" = "名称：";

/* No comment provided by engineer. */
"typeEditor.relationshipType.title.tooltip" = "调色板中显示的关系类型的可选标题";

/* No comment provided by engineer. */
"typeEditor.titlePlaceholder" = "无标题";

/* No comment provided by engineer. */
"undoableActionTitle.document.addElement" = "添加元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.addRelationship" = "添加连接";

/* No comment provided by engineer. */
"undoableActionTitle.document.addRelationshipLabel" = "添加连接标签";

/* No comment provided by engineer. */
"undoableActionTitle.document.addSampleElement" = "添加示例元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.adjustRelationshipRoute" = "调整连接路线";

/* No comment provided by engineer. */
"undoableActionTitle.document.changeElementType" = "更改元素类型";

/* No comment provided by engineer. */
"undoableActionTitle.document.changeRelationshipType" = "更改连接类型";

/* No comment provided by engineer. */
"undoableActionTitle.document.createElementType" = "创建元素类型";

/* No comment provided by engineer. */
"undoableActionTitle.document.createRelationshipType" = "创建连接类型";

/* No comment provided by engineer. */
"undoableActionTitle.document.customizePalette" = "自定义调色板";

/* No comment provided by engineer. */
"undoableActionTitle.document.cut" = "剪切";

/* No comment provided by engineer. */
"undoableActionTitle.document.cutElement" = "剪切元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.cutElement.plural" = "剪切元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.delete" = "删除";

/* No comment provided by engineer. */
"undoableActionTitle.document.deleteElement" = "删除元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.deleteElement.plural" = "删除元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.deleteRelationship" = "删除连接";

/* No comment provided by engineer. */
"undoableActionTitle.document.deleteRelationship.plural" = "删除连接";

/* No comment provided by engineer. */
"undoableActionTitle.document.deleteRelationshipLabel" = "删除连接标签";

/* No comment provided by engineer. */
"undoableActionTitle.document.deleteRelationshipLabel.plural" = "删除连接标签";

/* No comment provided by engineer. */
"undoableActionTitle.document.duplicate" = "创建副本";

/* No comment provided by engineer. */
"undoableActionTitle.document.duplicateElement" = "创建元素副本";

/* No comment provided by engineer. */
"undoableActionTitle.document.duplicateElement.plural" = "创建元素副本";

/* No comment provided by engineer. */
"undoableActionTitle.document.editElementCaption" = "编辑元素标题";

/* No comment provided by engineer. */
"undoableActionTitle.document.editRelationshipLabel" = "编辑连接标签";

/* No comment provided by engineer. */
"undoableActionTitle.document.lockRelationshipEnd" = "锁定连接末端";

/* No comment provided by engineer. */
"undoableActionTitle.document.lockRelationshipEnd.plural" = "锁定连接末端";

/* No comment provided by engineer. */
"undoableActionTitle.document.moveElement" = "移动元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.moveElement.plural" = "移动元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.moveRelationshipLabel" = "移动连接标签";

/* No comment provided by engineer. */
"undoableActionTitle.document.paste" = "粘贴";

/* No comment provided by engineer. */
"undoableActionTitle.document.pasteElement" = "粘贴元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.pasteElement.plural" = "粘贴元素";

/* No comment provided by engineer. */
"undoableActionTitle.document.reattachRelationship" = "重新连接连接";

/* No comment provided by engineer. */
"undoableActionTitle.document.resetRelationshipLabelPosition" = "重置连接标签位置";

/* No comment provided by engineer. */
"undoableActionTitle.document.resetRelationshipLabelPosition.plural" = "重置连接标签位置";

/* No comment provided by engineer. */
"undoableActionTitle.document.resetRelationshipRoute" = "重置连接路由";

/* No comment provided by engineer. */
"undoableActionTitle.document.resetRelationshipRoute.plural" = "重置连接路由";

/* No comment provided by engineer. */
"undoableActionTitle.document.resizeElement" = "调整元素大小";

/* No comment provided by engineer. */
"undoableActionTitle.document.reverseRelationship" = "反向连接";

/* No comment provided by engineer. */
"undoableActionTitle.document.reverseRelationship.plural" = "反向连接";

/* No comment provided by engineer. */
"undoableActionTitle.document.setElementType" = "设置元素类型";

/* No comment provided by engineer. */
"undoableActionTitle.document.setRelationshipType" = "设置连接类型";

/* No comment provided by engineer. */
"undoableActionTitle.document.unlockRelationshipEnd" = "解除锁定连接末端";

/* No comment provided by engineer. */
"undoableActionTitle.document.unlockRelationshipEnd.plural" = "解除锁定连接末端";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.changeAttributes" = "更改属性";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.changeTitle" = "更换标题";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.createElementType" = "创建元素类型";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.createRelationshipType" = "创建连接类型";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.deleteType" = "删除类别";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.deleteType.plural" = "删除类别";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.duplicateTypes" = "复制类别";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.reorderTypes" = "重新排序类别";

/* No comment provided by engineer. */
"undoableActionTitle.paletteEditor.revertChanges" = "还原";

